//жжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжж
// Грааль_1.mq4.
// Используется в качестве примера в статье "Мой первый Грааль".
// Сергей Ковалёв, Днепропетровск, sk@mail.dnepr.net, ICQ 64015987, http://autograf.dp.ua/.
//жжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжж
extern int     TP = 100;                                 // ТэйкПрофит ордера
extern int     SL = 100;                                 // СтопЛосс ордера
extern int     lim=   1;                                 // Дистанция возврата курса
extern int     prodvig=3;                                // Дистанция продвижения курса
extern double  Prots= 10;                                 // Процент от свободных средств
//--------------------------------------------------------------------------------------------
int
   total,                                                // Количество лотов
   bb=0,                                                 // 1 = факт налиия ордера Buy
   ss=0;                                                 // 1 = факт налиия ордера Sell 
//--------------------------------------------------------------------------------------------
double 
   max,                                                  // Максимальная цена на горке (абс)
   min,                                                  // Минимальная цена во впадине(абс)
   lmax,                                                 // Пороговая цена, после преодоления
                                                         // которой рассматриваем продажу(абс)
   lmin,                                                 // То же для покупки
   Lot;                                                  // Количество лотов
//жжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжж
int start()
   {   
//============================================================================================
   total=OrdersTotal();                                  // Количество лотов
   if (total==0)                                         // Если ордеров нет, ..
      {
      bb=0;                                              // .. то нет баёв
      ss=0;                                              // .. то нет селов
      }
   if (max<Bid) max=Bid;                                 // Считаем максим цену на горке 
   if (min>Ask) min=Ask;                                 // Считаем миним цену во впадине
//------------------------------------------------------------- Цена разворачивается вниз ----
   if (((max-Bid)>=lim*Point)&&(Bid>lmax ))              // Разворот на высовком уровне
      {
      for (int i=total;i>=0;i--)                         // По всем ордерам
         {                                               
         if (OrderSelect(i,SELECT_BY_POS,MODE_TRADES)==true && OrderType()==OP_BUY)
            {
            OrderClose(OrderTicket(),OrderLots(),Bid,3,CLR_NONE);// Закрываем бай
            bb=0;                                        // Баёв больше нет
            }
         }   
      Strateg(1);                                        // Открывающая функция
      }             
//------------------------------------------------------------ Цена разворачивается вверх ----
   if (((Ask-min)>=lim*Point)&&(lmin>Ask ))              // Разворот глубоко внизу
      {
      for (i=total;i>=0;i--)                             // По всем ордерам
         {
         if (OrderSelect(i,SELECT_BY_POS,MODE_TRADES)==true && OrderType()==OP_SELL)
            {         
            OrderClose(OrderTicket(),OrderLots(),Ask,3,CLR_NONE);// Закрываем селл   
            ss=0;                                        // Селлов больше нет
            }
         }
      Strateg(2);                                        // Открывающая функция
      }
//============================================================================================
   return;
   } 
//жжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжж
void Strateg (int vv)                                    // Открывающая функция
   {
//============================================================================================
   if (vv==1 && ss==0)                                   // Селловая ситуация и селлов нет
      {
      OrderSend(Symbol(),OP_SELL,Lots(),Bid,3,Bid+SL*Point,Bid-TP*Point,"",0,0,Red);// Откр
      ss=1;                                              // Теперь есть селл
      }
//--------------------------------------------------------------------------------------------
   if (vv==2 && bb==0)                                   // Баёвая ситуация и баёв нет
      {
      OrderSend(Symbol(),OP_BUY, Lots(),Ask,3,Ask-SL*Point,Ask+TP*Point,"",0,0,Blue);// Откр
      bb=1;                                              // Теперь есть бай
      }      
//--------------------------------------------------------------------------------------------
   lmax=Ask+prodvig*Point;                               // Переопределяем новые пороговые ..
   lmin=Bid-prodvig*Point;                               // .. уровни для откр и закр 
//============================================================================================
   return;
   }
//жжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжж
double Lots()                                            // Вычисление лотов
   {
//============================================================================================
   Lot=NormalizeDouble(AccountEquity()*Prots/100/1000,1);// Вычисляем колич. лотов  
   double Min_Lot = MarketInfo(Symbol(), MODE_MINLOT);   // Минимально допустимая стоим. лотов
   if (Lot == 0 ) Lot = Min_Lot;                         // Для теста на постоян. миним. лотах
//============================================================================================
   return(Lot);
   }
//жжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжжж




